{
    "projectId": "fe02e72c-ea75-4d31-a154-381e83c6bf13",
    "name": "Maelstrom Application 6 - Large-Scale Weather Regime Classification",
    "executiveSummary": "Classification of large-scale weather regimes for power prediction of renewable energy resources.",
    "detailedDescription": "# PCA and Clustering of Weather Data Features\\n\\nThe goal is to classify large-scale weather regimes (LSWRs) by performing a PCA on timeseries data containing multiple phyiscal quantities on a large grid covering the whole of Europe.\\nClassification is done by applying a clustering algorithm on the data that assigns each individual time step to a cluster, where outliers are allowed.\\n\\nTo allow classification of timeseries grid data, we apply a dimensionality reduction algorithm (PCA) and transform the original data into PC space. The PC space is a multi-dimensional space that represents the phase space of the dynamical system described by the data. To avoid the curse of dimensions, we use only a reduced amount of PCs for the transformation such that the PCs reflect most of the variance of the data.\\n\\nFor clustering the states of the dynamical system in PC space, we use the [hierarchical density-based spatial clustering algorithm for applications with noise (HDBSCAN)](https://arxiv.org/abs/1911.02282), which is a modification of the [DBSCAN](https://dl.acm.org/doi/10.5555/3001460.3001507) algorithm.\\n\\n## PCA\\n\\nThe PCA is performed on the whole dataset, whereas only 3 PCs are kept for the transformation. This is because we only have `10^3` data samples. Choosing more PCs would require more data (curse of dimensions). I.e., using `N` PCs would require at least `10^N` samples.\\n\\n## Clustering\\n\\nBefore applying the clustering, the data are transformed into the 3-D sub-space of the PC-space. The result reflects the phase space containing all states of the dynamical system throughout the given time span.\\n\\nWithin this space, we perform a clustering to find reoccuring states of the system. Each cluster represents a LSWR, i.e. all clusters represent the ensemble of LSWRs that our system resided in during the given time range. Each data point in a cluster hence reflects the time steps within the timeseries where the LSWR of the respective cluster appeared.\\n\\n## Statistical Analysis of the Clusters\\n\\nThe clusters (LSWRs) are then statistically analyzed such that we retrieve information about the LSWRs in general (total abundance, mean and standard deviation of their duration). In addition, we visualize the appearance of individual LSWR clusters at all time steps.\\n",
    "owner": {
        "$ref": "user.json"
    },
    "members": [
        {
            "$ref": "user.json"
        }
    ],
    "groups": [
        {
            "$ref": "userGroup.json"
        }
    ],
    "public": false,
    "codeRepositories": [
        {
            "$ref": "codeRepositories.json"
        }
    ],
    "experimentRepositories": [
        {
            "$ref": "experimentRepositories.json"
        }
    ],
    "dataRepositories": [
        {
            "$ref": "dataRepositories.json"
        }
    ],
    "labels": {
        "$ref": "labels1.json"
    }
}
